biorobotics/ecmo_psoc6_ws/PSOC code/CY8CPROTO-063-BLE_Master.cydsn/main_cm4.c
/* Foreground ISRs */
/**
 * @brief Program foreground, handles timer overflow interrupt with frequency 100 Hz
 * reads from ADPD1080 with frequency 100 Hz, and ADC with frequency 10 Hz
 * every ADC_SAMPLE_RATE_DIV interrupts, gets previous conversion results and starts next conversion
 * 
 * @param TimerInt_Handler - interrupt handler function name
 *
 * @return none
 */
CY_ISR (Timer_Int_Handler) {    
    // Clear timer overflow interrupt
    Timer_ClearInterrupt(CY_TCPWM_INT_ON_TC);
    
    // Read ADPD1080 data registers with data hold mechanism (6 ms)
    /*if (turbidity_ReadDataNoInterrupt(ADPD_NUM_CHANNELS)) {
        adpdDataA[timerCount] = au16DataSlotA[0];
        adpdDataB[timerCount] = au16DataSlotB[0];
    }
    else {
        adpdDataA[timerCount] = 0;
        adpdDataB[timerCount] = 0;
    }*/
    
    // Increment timer count
    timerCount++;
    timerCountDataCompare++;
    // Read ADC conversion results with frequency 10 Hz
    if (timerCount == ADC_SAMPLE_RATE_DIV) {
        timerCount = 0;        
        // Check conversion status without blocking
        uint32_t conversionStatus = ADC_IsEndConversion(CY_SAR_RETURN_STATUS);
        if (conversionStatus) {
            for (uint16_t i = 0; i < ADC_NUM_CHANNELS; i++) {
                Cy_SysLib_Delay(1u);
                ADCData[i] = ADC_GetResult16(i);
            }
            dataReady = true;            
            // Start next conversion
            ADC_StartConvert();
        }
        else {
            for (uint16_t i = 0; i < ADC_NUM_CHANNELS; i++) {
                ADCData[i] = 0;
            }
            // printf("error: Conversion not finished yet!");
            Cy_SysLib_Delay(5u); // wait 5 ms to signal error
        }        
    }
    if(timerCountDataCompare == dataCompareInterval){
        timerCountDataCompare = 0; 
        checkData = true;
    }
    
    // Flush write to hardware by reading from same register
    Timer_GetInterruptStatus();
}

/**
 * @brief main function
 */
int main(void) {
    // Variables for calculating oxygen saturation and hemoglobin concentration
    /*
    uint16_t L680 ; // Time Slot A Channel 1 (680 nm laser)
    uint16_t L850 ; // Time Slot B Channel 1 (850 nm laser)
    
    float32_t R;                 // Ratio of L680 to L850
    float32_t SO2;               // Oxygen saturation
    float32_t HBT;               // Hemoglobin concentration
    float32_t R_avg;             // Running average R
    float32_t SO2_avg;           // Running average SO2
    float32_t HBT_avg;           // Running average HBT
    

    // Maintain running average
    uint16_t slotA_avg[SMOOTHED_SAMPLE_SIZE] = {0};
    uint16_t slotB_avg[SMOOTHED_SAMPLE_SIZE] = {0};

    uint32_t posA = 0;
    uint32_t posB = 0;
    float32_t avg_valA = 0;
    float32_t avg_valB = 0;
    uint32_t sumA = 0;
    uint32_t sumB = 0;
    uint32_t lenA = sizeof(slotA_avg)/sizeof(uint16_t);
    uint32_t lenB = sizeof(slotB_avg)/sizeof(uint16_t);
    */
    // Store current size of sensor data UART packet and number of AES blocks
    uint8_t packetsize = 0, AESBlock_count = 0;
    
    // Initialize UART for debugging purposes
    UART_Start();
    
    // Intialize UART_1 for data transmission to Raspberry Pi
    UART_1_Start();

    // Initialize I2C for digital sensor communication
    //I2C_Start();
    
    // Intialize ADC for receiving analog sensor data
    ADC_Start();
    
    // Register Timer interrupt handler
    Cy_SysInt_Init(&Timer_Int_cfg, Timer_Int_Handler);
    NVIC_EnableIRQ(Timer_Int_cfg.intrSrc);
    
    __enable_irq();  // Enable global interrupts
    Cy_GPIO_Pin_FastInit(GPIO_PRT6, 3u, CY_GPIO_DM_STRONG, 1u, HSIOM_SEL_GPIO);
    Cy_GPIO_Set(GPIO_PRT6, 3u);   // drive high -> LED OFF
    
    
    // Initialize and configure the ADPD1080 sensor
    //printf("Initializing ADPD1080 sensor...\r\n");

    /*while (!ADPD1080_Begin(ADPD1080_ADDRESS, 0)) {
        printf("error: ADPD1080 sensor initialization failed!\r\n");
        Cy_SysLib_Delay(5u); // wait 5 ms before retrying
        while (1); // Loop forever on failure
    }*/
    
    // Initialize sensor registers
    //turbidity_Init();
    //printf("ADPD1080 sensor initialization successful.\r\n");
    


    /**************************************************/
    // Note: for Oct 30 day sheep study, we disable Crypto
    /**************************************************/

    /* Initialization of Crypto Driver */
	// while (Cy_Crypto_Init(&cryptoConfig, &cryptoScratch) != CY_CRYPTO_SUCCESS) {
    //     txBuffer[0] = encryptionErrorCode;
    //     UART_1_Transmit(txBuffer,1); 
    //     Cy_GPIO_Clr(GPIO_PRT6, 3u);   // drive low  -> LED ON
    // }

	/* Enable Crypto Hardware */
	// while (Cy_Crypto_Enable() != CY_CRYPTO_SUCCESS) {
    //     txBuffer[0] = encryptionErrorCode;
    //     UART_1_Transmit(txBuffer,1); 
    //     Cy_GPIO_Clr(GPIO_PRT6, 3u);   // drive low  -> LED ON
    // }

	/* Wait for Crypto Block to be available */
	//Cy_Crypto_Sync(CY_CRYPTO_SYNC_BLOCKING);
    
    /* Initializes the AES operation by setting key and key length */
	// while (Cy_Crypto_Aes_Init((uint32_t*)AES_Key, CY_CRYPTO_KEY_AES_128, &cryptoAES) != CY_CRYPTO_SUCCESS) {
    //     txBuffer[0] = encryptionErrorCode;
    //     UART_1_Transmit(txBuffer,1); 
    //     Cy_GPIO_Clr(GPIO_PRT6, 3u);   // drive low  -> LED ON
    // }

	/* Wait for Crypto Block to be available */
	//Cy_Crypto_Sync(CY_CRYPTO_SYNC_BLOCKING);
    




    // Begin first ADC scan
    ADC_StartConvert();
    
    // Initialize and start Timer to periodically handle ADC conversion results
    Timer_Start();
    
    txBuffer[0] = testSuccess;
    txBuffer[1] = 40;
    UART_1_Transmit(txBuffer,43);
    
    // Background loop
    for (;;) {
        // When data is ready, process, encrypt, and transmit packet
        if (dataReady) {
            dataReady = false;
            
            // Reset packetsize and AESBlock_count
            packetsize = 0, AESBlock_count = 0;
            
            // Process adpd1080 data
            /*for (uint8_t i = 0; i < ADPD_SAMPLES_PER_PACKET; i++) {
                // Raw light intensity
                L680 = adpdDataA[i];
                L850 = adpdDataB[i];
                
                // Normalize by pulse number
                float32_t L680_norm = L680/(float32_t)PULSE_A;
                float32_t L850_norm = L850/(float32_t)PULSE_B;
            
