biorobotics/ecmo_psoc6_ws/PSOC code/CY8CPROTO-063-BLE_Master.cydsn/main_cm4.c
                // Time average light intensity
                avg_valA = movingAvg(slotA_avg, &sumA, posA, lenA, L680)/(float32_t)PULSE_A;
                avg_valB = movingAvg(slotB_avg, &sumB, posB, lenB, L850)/(float32_t)PULSE_B;
                
                // Update ring buffer current position
                posA++;
                if (posA >= lenA) posA = 0;
                posB++;
                if (posB >= lenB) posB = 0;
                
                R = log(L680_norm)/log(L850_norm);
                R_avg = log(avg_valA)/log(avg_valB);
                
                // Hemoglobin concentration calculation
                HBT = HBTcal[0]*log(L680_norm) + HBTcal[1]*log(L850_norm) + HBTcal[2]*R
                        + HBTcal[3]*log(L680_norm)*log(L680_norm) + HBTcal[4]*log(L850_norm)*log(L850_norm)
                        + HBTcal[5]*R*R + HBTcal[6]*log(L680_norm)*log(L850_norm) 
                        + HBTcal[7]*log(L680_norm)*R + HBTcal[8];
                HBT_avg = HBTcal[0]*log(avg_valA) + HBTcal[1]*log(avg_valB) + HBTcal[2]*R_avg 
                        + HBTcal[3]*log(avg_valA)*log(avg_valA) + HBTcal[4]*log(avg_valB)*log(avg_valB)
                        + HBTcal[5]*R_avg*R_avg + HBTcal[6]*log(avg_valA)*log(avg_valB) 
                        + HBTcal[7]*log(avg_valA)*R_avg + HBTcal[8];
                
                // SO2% calculation
                float alpha = SO2cal_m[0]*HBT + SO2cal_m[1];
                float beta = SO2cal_b[0]*HBT + SO2cal_b[1];
                float alpha_avg = SO2cal_m[0]*HBT_avg + SO2cal_m[1];
                float beta_avg = SO2cal_b[0]*HBT_avg + SO2cal_b[1];
                
                SO2 = alpha*R + beta;
                SO2_avg = alpha_avg*R + beta_avg;
                
                // Populate packet buffer
                u16Int2Bytes(L680, &packet[packetsize]);
                packetsize += sizeof(uint16_t);
                
                u16Int2Bytes(L850, &packet[packetsize]);
                packetsize += sizeof(uint16_t);
                
                float2Bytes(SO2, &packet[packetsize]);
                packetsize += sizeof(float32_t);
                
                float2Bytes(SO2_avg, &packet[packetsize]);
                packetsize += sizeof(float32_t);
                
                float2Bytes(HBT, &packet[packetsize]);
                packetsize += sizeof(float32_t);
                
                printf("L680: %u, L850: %u, SO2: %f, SO2_avg: %f, HBT: %f\r\n", L680, L850, SO2, SO2_avg, HBT);
            }*/
            
            // Process ADC data
            uint8_t opcode = OPCODE_ALL;
            for (uint8_t i = 0; i < ADC_NUM_CHANNELS; i++) {
                float32_t ADCVolts = (3.3/3.3) * Cy_SAR_CountsTo_Volts(SAR, i, ADCData[i]);
                if(checkData == true){
                    if(i == ADC_NUM_CHANNELS - 1){
                        checkData = false;
                        if(savedADC!=0 && (savedADC >= ADCVolts + toleranceInterval || savedADC <= ADCVolts - toleranceInterval)){
                            opcode = ADCJumpErrorCode;
                        }
                        savedADC = ADCVolts;
                    }
                }
                if(ADCVolts > 3.3 || ADCVolts < 0){
                    opcode = ADCOORErrorCode;
                }
                float2Bytes(ADCVolts, &packet[packetsize]);
                packetsize += sizeof(float32_t);
                printf("ADC %d: %f, ", i, ADCVolts);
            }

            static const float32_t TWO_PI = 6.28318530718f;
            static const float32_t fakeADC_amp[2]   = {0.80f, 0.60f};          // amplitudes (V)
            static const float32_t fakeADC_off[2]   = {1.65f, 1.65f};          // DC offsets (V)
            static const float32_t fakeADC_freq[2]  = {0.20f, 0.11f};          // Hz (periods: 5.0s, ~9.1s)
            static float32_t       fakeADC_phase[2] = {0.0f, 0.0f};            // radians

            /* UART fake waves: signed int16; wide but safe amplitude */
            static const float32_t fakeUART_amp     = 2000.0f;                 // peak ≈ ±2000
            static const float32_t fakeUART_freq[8] = {0.50f, 0.33f, 0.25f, 0.20f,
                                                    0.16f, 0.14f, 0.12f, 0.10f};
            static float32_t       fakeUART_phase[8]= {0.0f, 0.0f, 0.0f, 0.0f,
                                                    0.0f, 0.0f, 0.0f, 0.0f};

            // float32_t fakePressure1 = 1.2345f;
            // float32_t fakePressure2 = 2.3456f;
            // float2Bytes(fakePressure1, &packet[packetsize]);
            // packetsize += sizeof(float32_t);
            // printf("Fake Pressure 1: %f, ", fakePressure1);
            // float2Bytes(fakePressure2, &packet[packetsize]);
            // packetsize += sizeof(float32_t);
            // printf("Fake Pressure 2: %f, ", fakePressure2);
            /* ADC fake waves: keep within 0..3.3 V with an offset around mid-supply */            
            
            /* ----------- Append two sinusoidal fake ADC float32 values ----------- */
            for (uint8_t k = 0; k < 2; ++k) {
                // advance phase
                fakeADC_phase[k] += TWO_PI * (fakeADC_freq[k] / 10.0f);
                if (fakeADC_phase[k] >= TWO_PI) fakeADC_phase[k] -= TWO_PI;

                // generate value
                float32_t v = fakeADC_off[k] + fakeADC_amp[k] * sinf(fakeADC_phase[k]);

                // clamp to 0..3.3 just in case
                if (v < 0.0f) v = 0.0f;
                if (v > 3.3f) v = 3.3f;

                float2Bytes(v, &packet[packetsize]);
                packetsize += sizeof(float32_t);

                printf("Fake Pressure %u: %f, ", (unsigned)k, v);
            }
            
            // int16_t fakeFlow[8] = { 0, 50, -50, 500, -500, 8191, -8192, 42 };
            // memcpy(&packet[packetsize], fakeFlow, sizeof(fakeFlow));
            // packetsize += sizeof(fakeFlow);
            // for (int i = 0; i < 8; i++) {
            //     printf("Fake Flow %d: %d, ", i, fakeFlow[i]);
            // }

            /* ----------- Append 16-byte sinusoidal fake UART block (8 × int16) ----------- */
            int16_t fakeUART_i16[8];
            for (uint8_t ch = 0; ch < 8; ++ch) {
                fakeUART_phase[ch] += TWO_PI * (fakeUART_freq[ch] / 10.0f);
                if (fakeUART_phase[ch] >= TWO_PI) fakeUART_phase[ch] -= TWO_PI;

                float32_t s = sinf(fakeUART_phase[ch]);
                int32_t sv = (int32_t)lrintf(fakeUART_amp * s);   // signed, around ±2000

                // saturate to int16 range
                if (sv >  8191) sv =  8191;
                if (sv < -8192) sv = -8192;

