biorobotics/ecmo_psoc6_ws/PSOC code/CY8CPROTO-063-BLE_Master.cydsn/main_cm4.c
                fakeUART_i16[ch] = (int16_t)sv;
            }

            // pack as raw little-endian int16 array (16 bytes total)
            memcpy(&packet[packetsize], fakeUART_i16, sizeof(fakeUART_i16));
            packetsize += sizeof(fakeUART_i16);

            for (uint8_t ch = 0; ch < 8; ++ch) printf("Fake Flow %u: %d ", ch, fakeUART_i16[ch]); printf("\r\n");
            
            printf("\r\n");
            
            /**************************************************/
            // Note: for Oct 30 day sheep study, we disable Crypto
            /**************************************************/
            // Encrypt packet
            // AESBlock_count = (packetsize % AES128_ENCRYPTION_LENGTH == 0) ? \
			// 					  (packetsize/AES128_ENCRYPTION_LENGTH) \
			// 					  : (1 + packetsize/AES128_ENCRYPTION_LENGTH);
                                
			// for (int i = 0; i < AESBlock_count ; i++) {
			// 	/* Perform AES ECB Encryption mode of operation */
			// 	cy_en_crypto_status_t status;
            //     status = Cy_Crypto_Aes_Ecb_Run(CY_CRYPTO_ENCRYPT,\
			// 	(uint32_t*) (encrypted_pkt + AES128_ENCRYPTION_LENGTH * i),\
			// 	(uint32_t*) (packet + AES128_ENCRYPTION_LENGTH * i), &cryptoAES);
            //     if (status != CY_CRYPTO_SUCCESS) {
            //         // printf("error: AES Encryption failed!\r\n");
            //         Cy_SysLib_Delay(5u); // wait 5 ms to signal error
            //     }

			// 	/* Wait for Crypto Block to be available */
			// 	Cy_Crypto_Sync(CY_CRYPTO_SYNC_BLOCKING);
			// }
            
            // Transmit packet
            //wrap_data(opcode, encrypted_pkt, AESBlock_count*AES128_ENCRYPTION_LENGTH);

            wrap_data(opcode, packet, packetsize);
        }
    }
}

/* Helper functions */
/**
 * @brief calculates the CRC8 for an outgoing UART packet
 * 
 * @param uint8_t opCode - the operation type of the outgoing packet
 * @param uint8_t dataLength - the length of the payload to send
 * @param uint8_t *data - pointer to an array of the Tx payload bytes
 *
 * @return uint8_t - calculated CRC byte from input parameters
 * @note Helper function for wrap_data()
*/
uint8_t calculateCRC8(uint8_t opCode, uint8_t dataLength, uint8_t* data) {
  uint8_t crc = 0x00; // Initialize CRC value

  // Update CRC with the opcode
  crc = crcTable[crc ^ opCode];
  
  // Update CRC with the data length
  crc = crcTable[crc ^ dataLength];
  
  // Update CRC with each data byte
  for (uint8_t i = 0; i < dataLength; i++) {
    crc = crcTable[crc ^ data[i]];
  }

  return crc;
}

/**
 * @brief Populate buffer with metadata and data and start transmission
 * 
 * @param uint8_t opcode - type of transmission TODO: replace with enum
 * @param uint8_t *data - pointer to buffer containing data to send
 * @param uint8_t length - number of bytes in data (0-255) 
 *
 * @note Buffer being transmitted must be constant and allocated until transmit operation completes
*/
void wrap_data(uint8_t opcode, uint8_t* data, uint8_t length) {
    // Ensure previous transmission is not ongoing before modifying transmit buffer
    //printf("Try to send data \r\n");
    while (UART_1_GetTransmitStatus() == CY_SCB_UART_TRANSMIT_ACTIVE) {
        // printf("Waiting for previous transmission to complete\r\n");
        Cy_GPIO_Clr(GPIO_PRT6, 3u);   // drive low  -> LED ON
        Cy_SysLib_Delay(5u); // wait 5 ms for completion        
    }
    
    cy_en_scb_uart_status_t status;
    txBuffer[0] = opcode;
    txBuffer[1] = length;
    memcpy(&txBuffer[2], data, length);
    txBuffer[2 + length] = calculateCRC8(opcode, length, data);
    Cy_GPIO_Set(GPIO_PRT6, 3u);   // drive high -> LED OFF
    status = UART_1_Transmit(txBuffer, 2 + length + 1);
    //printf("Sent data \r\n");
    if (status != CY_SCB_UART_SUCCESS) {
        // printf("\r\nerror: Tx status 0x%x\r\n", status);
        Cy_GPIO_Clr(GPIO_PRT6, 3u);   // drive low  -> LED ON
        Cy_SysLib_Delay(5u); // wait 5 ms to signal error
        //printf("Data failed \r\n");
    }
    
    // demo only
    //printf("\r\n\nopcode: %d, length: %d, crc: 0x%x\r\n", opcode, length, txBuffer[2 + length]);    
}

/**
 * @brief Helper function for main background loop moving average processing
 * 
 * @author <bmccormack> - https://gist.github.com/bmccormack/d12f4bf0c96423d03f82
 * 
 * @param int *ptrArrNumbers - pointer to current data points
 * @param long &ptrSum - pointer to current sum of data points
 * @param int pos - current position within array of data points
 * @param int len - total number of data points
 * @param int nextNum - next data point to add
 *
 * @return int - the moving average after nextNum added
*/
/*float32_t movingAvg(uint16_t *ptrArrNumbers, uint32_t *ptrSum, uint32_t pos, uint32_t len, uint16_t nextNum) {
    // Subtract the oldest number from the prev sum, add the new number
    *ptrSum = *ptrSum - ptrArrNumbers[pos] + nextNum;
    
    // Assign the nextNum to the position in the array
    ptrArrNumbers[pos] = nextNum;
    
    // return the average
    return (float32_t)*ptrSum / len;
}*/

/**
 * @brief Helper function for main background loop converting float to uint8_t array
 * 
 * @author <Floris> - https://stackoverflow.com/questions/24420246/c-function-to-convert-float-to-byte-array
 * 
 * @param float32_t val - single precision float value to be converted to uint8_t array of length 4
 * @param uint8_t *bytesArray - pointer to uint8_t array in memory
 *
 * @return none
*/
void float2Bytes(float32_t val, uint8_t *bytes_array) {
    // Create union of shared memory space
    union {
        float32_t float_variable;
        uint8_t temp_array[4];
    } u;
    // Overite bytes of union with float variable
    u.float_variable = val;
    // Assign bytes to input array
    memcpy(bytes_array, u.temp_array, 4);
}

/**
 * @brief Helper function for main background loop converting uint16_t to uint8_t array
 *
 * @note based on float2Bytes
 * @return none
*/
void u16Int2Bytes(uint16_t val, uint8_t *bytes_array) {
    // Create union of shared memory space
    union {
        uint16_t int_variable;
        uint8_t temp_array[2];
    } u;
    // Overite bytes of union with float variable
    u.int_variable = val;
    // Assign bytes to input array
    memcpy(bytes_array, u.temp_array, 2);
}

/**
 * @brief: Debug-only function used to display the data in hexadecimal format
 *
 * @param: uint8_t* - Pointer to location of data to be printed
 *
 * @return: void
*/
void PrintData(uint8_t* data, uint8_t len) {
	printf("\r\n");
	char print[10];
	for(uint32 i=0; i < len; i++) {
		sprintf(print,"0x%02X ", *(data+i));
		printf("%s", print);
	}
	printf("\r\n");
}

/* [] END OF FILE */
